interface/app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO `companies` (`name`, `created_at`, `updated_at`, `email`) VALUES ('Invoice Barrack', '2015-07-30 13:35:56', '2015-07-30 13:35:56', 'invoice@invoicebarrack.in')

    def set_company
      @company = Company.find(params[:id])
---
SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1