interface/app/controllers/invoices_controller.rb

SELECT COUNT(*) FROM `invoices` WHERE `invoices`.`bucket_id` = 2
SELECT `invoices`.* FROM `invoices` WHERE `invoices`.`company_id` = 2 AND `invoices`.`bucket_id` = 4
SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 5 LIMIT 1
SELECT `buckets`.* FROM `buckets` WHERE `buckets`.`company_id` = 1
SELECT `invoices`.* FROM `invoices` WHERE `invoices`.`company_id` = 5
---
  def index
    if params[:bucket]
      @invoices = current_user.company.invoices.where(:bucket_id => params[:bucket])
    else
      @buckets = current_user.company.buckets.all.includes(:invoices)

SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 5 LIMIT 1
---
    def set_invoice
      @invoice = current_user.company.invoices.find(params[:id])