interface/app/controllers/users_controller.rb

    def set_user
      @user = current_user.company.users.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1