interface/app/views/invoices/index.html.haml

SELECT COUNT(*) FROM `invoices` WHERE `invoices`.`bucket_id` = 2
SELECT `invoices`.* FROM `invoices` WHERE `invoices`.`bucket_id` IN (2, 3, 4)
---
              = bucket.name
              %span.badge= bucket.invoices.size